setup/build_rails/backend/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "hello world"], ["created_at", "2020-11-26 18:21:27.633227"], ["updated_at", "2020-11-26 18:21:27.633227"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save