setup/build_rails/backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all
    if @users.length > 0